In [1]:
import pandas as pd
import os # To check the default path of the system.
#print(os.getcwd()) _________________ C:\Users\lokes ( Moved the Dataset here ) 
df = pd.read_csv('customer_shopping_behavior.csv')

In [2]:
df.head() #____________________To see a small part of data.

,Customer ID,Age,Gender,Item Purchased,Category,Purchase Amount (USD),Location,Size,Color,Season,Review Rating,Subscription Status,Shipping Type,Discount Applied,Promo Code Used,Previous Purchases,Payment Method,Frequency of Purchases
0,1,55,Male,Blouse,Clothing,53,Kentucky,L,Gray,Winter,3.1,Yes,Express,Yes,Yes,14,Venmo,Fortnightly
1,2,19,Male,Sweater,Clothing,64,Maine,L,Maroon,Winter,3.1,Yes,Express,Yes,Yes,2,Cash,Fortnightly
2,3,50,Male,Jeans,Clothing,73,Massachusetts,S,Maroon,Spring,3.1,Yes,Free Shipping,Yes,Yes,23,Credit Card,Weekly
3,4,21,Male,Sandals,Footwear,90,Rhode Island,M,Maroon,Spring,3.5,Yes,Next Day Air,Yes,Yes,49,PayPal,Weekly
4,5,45,Male,Blouse,Clothing,49,Oregon,M,Turquoise,Spring,2.7,Yes,Free Shipping,Yes,Yes,31,PayPal,Annually

In [3]:
df.info() #______________To check the schema or structure of the data.

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 3900 entries, 0 to 3899
Data columns (total 18 columns):
 #   Column                  Non-Null Count  Dtype
---  ------                  --------------  -----
 0   Customer ID             3900 non-null   int64
 1   Age                     3900 non-null   int64
 2   Gender                  3900 non-null   object
 3   Item Purchased          3900 non-null   object
 4   Category                3900 non-null   object
 5   Purchase Amount (USD)   3900 non-null   int64
 6   Location                3900 non-null   object
 7   Size                    3900 non-null   object
 8   Color                   3900 non-null   object
 9   Season                  3900 non-null   object
 10  Review Rating           3863 non-null   float64
 11  Subscription Status     3900 non-null   object
 12  Shipping Type           3900 non-null   object
 13  Discount Applied        3900 non-null   object
 14  Promo Code Used         3900 non-null   object
 15  Previous Purchases      3900 non-null   int64
 16  Payment Method          3900 non-null   object
 17  Frequency of Purchases  3900 non-null   object
dtypes: float64(1), int64(4), object(13)
memory usage: 548.6+ KB

In [4]:
df.describe(include='all') #______ To check the summary stats of the data.

,Customer ID,Age,Gender,Item Purchased,Category,Purchase Amount (USD),Location,Size,Color,Season,Review Rating,Subscription Status,Shipping Type,Discount Applied,Promo Code Used,Previous Purchases,Payment Method,Frequency of Purchases
count,3900.000000,3900.000000,3900,3900,3900,3900.000000,3900,3900,3900,3900,3863.000000,3900,3900,3900,3900,3900.000000,3900,3900
unique,NaN,NaN,2,25,4,NaN,50,4,25,4,NaN,2,6,2,2,NaN,6,7
top,NaN,NaN,Male,Blouse,Clothing,NaN,Montana,M,Olive,Spring,NaN,No,Free Shipping,No,No,NaN,PayPal,Every 3 Months
freq,NaN,NaN,2652,171,1737,NaN,96,1755,177,999,NaN,2847,675,2223,2223,NaN,677,584
mean,1950.500000,44.068462,NaN,NaN,NaN,59.764359,NaN,NaN,NaN,NaN,3.750065,NaN,NaN,NaN,NaN,25.351538,NaN,NaN
std,1125.977353,15.207589,NaN,NaN,NaN,23.685392,NaN,NaN,NaN,NaN,0.716983,NaN,NaN,NaN,NaN,14.447125,NaN,NaN
min,1.000000,18.000000,NaN,NaN,NaN,20.000000,NaN,NaN,NaN,NaN,2.500000,NaN,NaN,NaN,NaN,1.000000,NaN,NaN
25%,975.750000,31.000000,NaN,NaN,NaN,39.000000,NaN,NaN,NaN,NaN,3.100000,NaN,NaN,NaN,NaN,13.000000,NaN,NaN
50%,1950.500000,44.000000,NaN,NaN,NaN,60.000000,NaN,NaN,NaN,NaN,3.800000,NaN,NaN,NaN,NaN,25.000000,NaN,NaN
75%,2925.250000,57.000000,NaN,NaN,NaN,81.000000,NaN,NaN,NaN,NaN,4.400000,NaN,NaN,NaN,NaN,38.000000,NaN,NaN
max,3900.000000,70.000000,NaN,NaN,NaN,100.000000,NaN,NaN,NaN,NaN,5.000000,NaN,NaN,NaN,NaN,50.000000,NaN,NaN

In [5]:
df.isnull().sum() #_________TO check the Null Values in each column of the dataset.

Customer ID                0
Age                        0
Gender                     0
Item Purchased             0
Category                   0
Purchase Amount (USD)      0
Location                   0
Size                       0
Color                      0
Season                     0
Review Rating             37
Subscription Status        0
Shipping Type              0
Discount Applied           0
Promo Code Used            0
Previous Purchases         0
Payment Method             0
Frequency of Purchases     0
dtype: int64

In [6]:
# As we can see the Review rating column has 37 Null values. But we cannot drop this pertuicular column as it is essential column as it will help us to analyse. So we will fill the median value.

In [7]:
df['Review Rating'] = df.groupby('Category')['Review Rating'].transform(lambda x:x. fillna(x.median())) 
# _ Filled with the median values of the review ratings by their categories.

In [8]:
df.isnull().sum() # _______ Now there are no null values.

Customer ID               0
Age                       0
Gender                    0
Item Purchased            0
Category                  0
Purchase Amount (USD)     0
Location                  0
Size                      0
Color                     0
Season                    0
Review Rating             0
Subscription Status       0
Shipping Type             0
Discount Applied          0
Promo Code Used           0
Previous Purchases        0
Payment Method            0
Frequency of Purchases    0
dtype: int64

In [9]:
#__Cleaning the column names so it will be easy to use (converted it into snake Case)
df.columns = df.columns.str.lower() 
df.columns = df.columns.str.replace(' ','_')
df = df.rename(columns= {'purchase_amount_(usd)':'purchase_amount'})

In [10]:
df.columns

Index(['customer_id', 'age', 'gender', 'item_purchased', 'category',
       'purchase_amount', 'location', 'size', 'color', 'season',
       'review_rating', 'subscription_status', 'shipping_type',
       'discount_applied', 'promo_code_used', 'previous_purchases',
       'payment_method', 'frequency_of_purchases'],
      dtype='object')

In [11]:
#Create  a column age_group (To distribute the customers on the basis of their age which will help to analyse better)

labels = ['Young Adult','Adult','Middle_aged','Senior']
df['age_group'] = pd.qcut(df['age'], q=4, labels = labels)

In [12]:
df[['age','age_group']].head(10) #___To see the division.

   age    age_group
0   55  Middle_aged
1   19  Young Adult
2   50  Middle_aged
3   21  Young Adult
4   45  Middle_aged
5   46  Middle_aged
6   63       Senior
7   27  Young Adult
8   26  Young Adult
9   57  Middle_aged

In [13]:
# purchase_frequency_days column to know the number of days between the purchase.
frequency_mapping ={
    'fortnightly': 14,
    'Weekly' :7,
    'Monthly' : 30,
    'Quarterly' : 90,
    'Bi-Weekly' : 14,
    'Annually' :365,
    'Every 3 months': 90
}

df[ 'purchase_frequency_days'] = df['frequency_of_purchases'].map(frequency_mapping)

In [14]:
df[['purchase_frequency_days','frequency_of_purchases']].head(10) 
# Created the column purchase_frequency_days to know the exact difference between the previous purchase and new purchase of a customer.

   purchase_frequency_days frequency_of_purchases
0                      NaN            Fortnightly
1                      NaN            Fortnightly
2                      7.0                 Weekly
3                      7.0                 Weekly
4                    365.0               Annually
5                      7.0                 Weekly
6                     90.0              Quarterly
7                      7.0                 Weekly
8                    365.0               Annually
9                     90.0              Quarterly

In [15]:
df[['discount_applied','promo_code_used']].head(10) 
# checking if both the columns have the same data ?

  discount_applied promo_code_used
0              Yes             Yes
1              Yes             Yes
2              Yes             Yes
3              Yes             Yes
4              Yes             Yes
5              Yes             Yes
6              Yes             Yes
7              Yes             Yes
8              Yes             Yes
9              Yes             Yes

In [16]:
(df['discount_applied'] == df['promo_code_used']).all() 
#_________ It shows true, Which means both the column carry the same data so we can remove one.

np.True_

In [17]:
df = df.drop('promo_code_used', axis=1) # Removed

In [18]:
df.columns

Index(['customer_id', 'age', 'gender', 'item_purchased', 'category',
       'purchase_amount', 'location', 'size', 'color', 'season',
       'review_rating', 'subscription_status', 'shipping_type',
       'discount_applied', 'previous_purchases', 'payment_method',
       'frequency_of_purchases', 'age_group', 'purchase_frequency_days'],
      dtype='object')

In [47]:
pip install psycopg2-binary sqlalchemy
pip install psycopg2-binary sqlalchemy
#Lib to connect with the SQL Database

Defaulting to user installation because normal site-packages is not writeable
Note: you may need to restart the kernel to use updated packages.

ERROR: Invalid requirement: '#Lib': Expected package name at the start of dependency specifier
    #Lib
    ^

In [ ]:
from sqlalchemy import create_engine
import urllib.parse 

# --- 1. DEFINE YOUR DATABASE CREDENTIALS ---
username = "postgres"
raw_password = "APPLEiphone@13" # Password
host = "localhost"
port = "5432"
database = "customer_behavior"


encoded_password = urllib.parse.quote_plus(raw_password) 

CONNECTION_STRING = f"postgresql+psycopg2://{username}:{encoded_password}@{host}:{port}/{database}"

engine = create_engine(CONNECTION_STRING)

# --- 4. WRITE THE DATAFRAME TO A SQL TABLE ---
table_name = "customer"
df.to_sql(table_name, engine, if_exists="replace", index=False)
 
print(f"Data Successfully loaded '{table_name}' in database '{database}'.")

In [52]:
pip install pymysql sqlalchemy #________ to connect with workbench (MYSQL)

Defaulting to user installation because normal site-packages is not writeable
Requirement already satisfied: pymysql in c:\users\lokes\appdata\roaming\python\python313\site-packages (1.1.2)
Requirement already satisfied: sqlalchemy in c:\users\lokes\appdata\roaming\python\python313\site-packages (2.0.44)
Requirement already satisfied: greenlet>=1 in c:\users\lokes\appdata\roaming\python\python313\site-packages (from sqlalchemy) (3.2.4)
Requirement already satisfied: typing-extensions>=4.6.0 in c:\users\lokes\appdata\roaming\python\python313\site-packages (from sqlalchemy) (4.12.2)
Note: you may need to restart the kernel to use updated packages.

In [56]:
import pandas as pd
from sqlalchemy import create_engine
import urllib.parse 

# --- 1. DEFINE YOUR DATABASE CREDENTIALS ---
username = "root"
raw_password = "APPLEiphone@13" # Password 
host = "127.0.0.1"
port = "3306"
database = "customer_behavior"


encoded_password = urllib.parse.quote_plus(raw_password) 


CONNECTION_STRING = f"mysql+pymysql://{username}:{encoded_password}@{host}:{port}/{database}"

engine = create_engine(CONNECTION_STRING)

table_name = "customer"

try:
    df.to_sql(table_name, engine, if_exists="replace", index=False)
    
    print(f"Data Successfully loaded '{table_name}' in database '{database}'.")
    
except Exception as e:
    # This will catch genuine connection errors (like wrong password or server off)
    print(f"Connection/Write Error: {e}") 
    print("\nIf the error persists, check your username, password, and ensure your MySQL server is running.")

Data Successfully loaded 'customer' in database 'customer_behavior'.

In [ ]:
# We have connected both the PostgreSQL as well as MYSQL Workbench.